{"pageProps":{"story":{"id":"1","slug":"vang-chong","title":"When He’s Gone","description":"An emotionally gripping story of a lonely wife whose husband is away—until her first love suddenly reappears.","genre":["Emotional","Infidelity"],"chapters":13,"status":"ongoing","cover":"/images/vangchong.jpg"},"chapter":{"id":3,"title":"Chapter 3: Scent of a Storm","tag":"","content":"<p>She had no idea when she drifted off that night — her mind a whirlpool of tangled emotions. Her heart, a knotted mess. Her body, strangely hollow… and damp.</p>\n<p>Outside, the night breeze rustled through the trees, whispering like voices from a long-lost memory. Streetlights cast blurred shadows across the ceiling, as hazy as her thoughts.</p>\n<p>In her dream, she was making love to her husband — wild, intense. Yet the man’s face began to blur… until it wasn’t her husband anymore. It was Quan. His deep, burning eyes seared through her.</p>\n<p>She tried to resist, but her body followed each breath, each longing moan.</p>\n<p>She woke with sweat across her brow — and between her thighs. The dream had left its mark. A dream… or a buried desire clawing its way out?</p>\n<p>Morning crept in. Soft light filtered through the curtain slits, casting a gentle blush across her bedsheet. The lingering scent of fabric and her hair from the night before still clung to the air — faint and familiar, like the warmth of a dream that hadn’t yet faded.</p>\n<p>Quan’s message resurfaced in her mind:</p>\n<p>“If you’re free this afternoon… I want to see you. Just once.”</p>\n<p>She didn’t answer. Part of her wanted to delete it — to erase the past. But another part… wanted to see him. Not to rekindle anything, but to ask. To look into his eyes and see if something was still left unsaid.</p>\n<p>Sunlight filtered through the leaves outside, dancing across the swaying white curtain. The faint scent of jasmine from the diffuser floated in the air, thin as a memory. The room was so quiet, she could hear her own soft breathing.</p>\n<p>She picked up her phone, then set it down again. Her thoughts circled: I’m married… Would meeting him cross a line? Or is it just a conversation?</p>\n<p>A moment’s hesitation. Then those eyes — Quan’s eyes — appeared clearly in her mind, the same eyes that once made her heart skip.</p>\n<p>She couldn’t delete it. Not yet.</p>\n<p>She sat there in silence for a long while. Memories came flooding back. Their college days — a love once thought unbreakable. But distance, family, choices… had pulled them apart.</p>\n<p>Tears welled in her eyes. Not sobbing — just quiet drops. Regret. Fear. Powerlessness. She knew that if she saw him again, it would be hard to keep her feelings in check.</p>\n<p>But then she whispered to herself, like a gentle self-convincing:</p>\n<p>“It’s just an old friend, that’s all…”</p>\n<p>And then… she texted back:</p>\n<p>“Why do you still have my number?”</p>\n<p>The message sent. A moment later, her screen lit up.</p>\n<p>“I never deleted it.”</p>\n<p>Just four words. But they struck deep, tapping something inside her she thought long buried.</p>\n<p>That afternoon, they met at a riverside café — the same one they used to frequent during college.</p>\n<p>It was a small place, carrying the scent of roasted coffee and aged wood. Rustic tables and chairs, paint chipped with time. A pot of bougainvillea fluttered gently in the breeze.</p>\n<p>Ha Anh arrived first. She chose a table on the patio. The setting sun cast a golden hue on her hair, on the rim of her glass as she slowly turned it in her hand.</p>\n<p>Then Quan appeared.</p>\n<p>Still tall, with that quietly melancholic gaze. His white shirt slightly wrinkled. He paused when he saw her — as if afraid the moment might vanish.</p>\n<p>Their eyes met. No words. Just heartbeats and silence.</p>\n<p>“It’s been a while…” — he finally said, voice low, almost lost in the wind.</p>\n<p>“Yeah… a long time.” — she replied, trying to keep her tone even.</p>\n<p>A breeze passed. The scent of coffee and wood stirred old memories.</p>\n<p>“I used to imagine… if we met again, I’d say so much. But now… I don’t know where to start.”</p>\n<p>“Just seeing you like this… I already understand,” she whispered, her voice trembling.</p>\n<p>Silence again.</p>\n<p>“I was angry… at the world when you left. I buried myself in work, chasing things to forget. But the harder I tried, the clearer your memory became.”</p>\n<p>She looked up at him. Something unnamed flickered in her eyes.</p>\n<p>“I promised myself — if I ever made it, I’d find you again. Now I’m the CEO of an IT company. I came back. But when I heard you got married… it felt like falling into an abyss.”</p>\n<p>The wind brushed past. She shivered slightly.</p>\n<p>“It wasn’t a coincidence… me buying an apartment near yours,” Quan said softly. “I haven’t let go. I never truly did.”</p>\n<p>They sat a while longer. Talking little. Saying nothing deep. But their eyes kept meeting — enough to stir the heart, but not enough to close the distance.</p>\n<p>When it was time to leave, Quan stood first. Ha Anh nodded, walking beside him toward the exit. The evening breeze cooled the air.</p>\n<p>“I’ll walk you home?” — he asked gently.</p>\n<p>She shook her head with a faint smile. “No… I’ll walk a bit on my own. Clear my head.”</p>\n<p>“Alright…” — he nodded, the quiet disappointment unhidden.</p>\n<p>They stood there a few seconds. As if words lingered, unspoken. But in the end, silence won.</p>\n<p>A single nod — their farewell.</p>\n<p>They turned. Each walking a different way.</p>\n<p>The slanting sun stretched their shadows in opposite directions.</p>\n<p>On her way home, Ha Anh felt her heart beating faster than usual. A mix of relief… and hollowness.</p>\n<p>Nothing wrong had happened — but it wasn’t entirely right either.</p>\n<p>And Quan, hands in his pockets, eyes on the sun-speckled pavement. She was still as beautiful as ever. But now… she belonged to someone else.</p>\n<p>A meeting that seemed harmless — but within them both, a dormant current had been stirred awake.</p>\n<p>A meeting that seemed harmless —<br>but within them both,<br>a dormant current had been stirred awake.</p>\n"},"chapterList":[{"id":1,"title":"Chapter 1: The Quiet Yearning","tag":""},{"id":2,"title":"Chapter 2: A Knock in the Dark","tag":""},{"id":3,"title":"Chapter 3: Scent of a Storm","tag":""},{"id":4,"title":"Chapter 4: Between the Drops","tag":""},{"id":5,"title":"Chapter 5: Glasses of Longing","tag":""},{"id":6,"title":"Chapter 6: From a Single Touch","tag":""},{"id":7,"title":"Chapter 7: When the Body Speaks","tag":""},{"id":8,"title":"Chapter 8: Sleepless Night","tag":""},{"id":9,"title":"Chapter 9: A New Flavor of Temptation","tag":""},{"id":10,"title":"Chapter 10: Everything That Trembled Inside Her","tag":""},{"id":11,"title":"Chapter 11: The Day He Returned","tag":""},{"id":12,"title":"Chapter 12: In His Arms, Yet Out of Rhythm","tag":""},{"id":13,"title":"Chapter 13: The Final Offering","tag":""}]},"__N_SSG":true}